In [31]:
import pandas as pd 
import numpy as np

# data dictionary
data = {
    'Name': ['Alicia', 'Bob', 'Naved', 'David'],
    'Age': [25, np.nan, 35, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan],
    'Salary': [100000, 120000, 140000, 160000]
}

df = pd.DataFrame(data)
df
#print(df.isnull().sum())

     Name   Age         City  Salary
0  Alicia  25.0     New York  100000
1     Bob   NaN  Los Angeles  120000
2   Naved  35.0      Chicago  140000
3   David   NaN          NaN  160000

In [32]:
#df['Age'].mean()
#last_column = df.iloc[:, -1]
#last_column

In [33]:
df['Age'] = df['Age'].fillna(30)
df['City'] = df['City'].fillna('Unknown')
df

     Name   Age         City  Salary
0  Alicia  25.0     New York  100000
1     Bob  30.0  Los Angeles  120000
2   Naved  35.0      Chicago  140000
3   David  30.0      Unknown  160000